Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/dsu.h
/* -------- DSU_ENTRY2 : (DSU Offset: 0x1008) ( R/ 32) CoreSight ROM Table Entry N Register -------- */
#define DSU_ENTRY2_RESETVALUE                 _UINT32_(0xBBFFF002)                                 /*  (DSU_ENTRY2) CoreSight ROM Table Entry N Register  Reset Value */

#define DSU_ENTRY2_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY2) CoreSight Entry Present Position */
#define DSU_ENTRY2_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY2_EPRES_Pos)              /* (DSU_ENTRY2) CoreSight Entry Present Mask */
#define DSU_ENTRY2_EPRES(value)               (DSU_ENTRY2_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY2_EPRES_Pos)) /* Assignment of value for EPRES in the DSU_ENTRY2 register */
#define   DSU_ENTRY2_EPRES_0_Val              _UINT32_(0x0)                                        /* (DSU_ENTRY2) Entry not present  */
#define   DSU_ENTRY2_EPRES_1_Val              _UINT32_(0x1)                                        /* (DSU_ENTRY2) Entry present  */
#define DSU_ENTRY2_EPRES_0                    (DSU_ENTRY2_EPRES_0_Val << DSU_ENTRY2_EPRES_Pos)     /* (DSU_ENTRY2) Entry not present Position */
#define DSU_ENTRY2_EPRES_1                    (DSU_ENTRY2_EPRES_1_Val << DSU_ENTRY2_EPRES_Pos)     /* (DSU_ENTRY2) Entry present Position */
#define DSU_ENTRY2_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY2) CoreSight Rom Table Format Position */
#define DSU_ENTRY2_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY2_FMT_Pos)                /* (DSU_ENTRY2) CoreSight Rom Table Format Mask */
#define DSU_ENTRY2_FMT(value)                 (DSU_ENTRY2_FMT_Msk & (_UINT32_(value) << DSU_ENTRY2_FMT_Pos)) /* Assignment of value for FMT in the DSU_ENTRY2 register */
#define   DSU_ENTRY2_FMT_0_Val                _UINT32_(0x0)                                        /* (DSU_ENTRY2) 8-bit format  */
#define   DSU_ENTRY2_FMT_1_Val                _UINT32_(0x1)                                        /* (DSU_ENTRY2) 32-bit format  */
#define DSU_ENTRY2_FMT_0                      (DSU_ENTRY2_FMT_0_Val << DSU_ENTRY2_FMT_Pos)         /* (DSU_ENTRY2) 8-bit format Position */
#define DSU_ENTRY2_FMT_1                      (DSU_ENTRY2_FMT_1_Val << DSU_ENTRY2_FMT_Pos)         /* (DSU_ENTRY2) 32-bit format Position */
#define DSU_ENTRY2_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY2) CoreSight ROM Table Address Offset Position */
#define DSU_ENTRY2_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY2_ADDOFF_Pos)         /* (DSU_ENTRY2) CoreSight ROM Table Address Offset Mask */
#define DSU_ENTRY2_ADDOFF(value)              (DSU_ENTRY2_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY2_ADDOFF_Pos)) /* Assignment of value for ADDOFF in the DSU_ENTRY2 register */
#define DSU_ENTRY2_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY2) Register Mask  */


/* -------- DSU_ENTRY3 : (DSU Offset: 0x100C) ( R/ 32) CoreSight ROM Table Entry N Register -------- */
#define DSU_ENTRY3_RESETVALUE                 _UINT32_(0xBBFFF002)                                 /*  (DSU_ENTRY3) CoreSight ROM Table Entry N Register  Reset Value */

#define DSU_ENTRY3_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY3) CoreSight Entry Present Position */
#define DSU_ENTRY3_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY3_EPRES_Pos)              /* (DSU_ENTRY3) CoreSight Entry Present Mask */
#define DSU_ENTRY3_EPRES(value)               (DSU_ENTRY3_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY3_EPRES_Pos)) /* Assignment of value for EPRES in the DSU_ENTRY3 register */
#define   DSU_ENTRY3_EPRES_0_Val              _UINT32_(0x0)                                        /* (DSU_ENTRY3) Entry not present  */
#define   DSU_ENTRY3_EPRES_1_Val              _UINT32_(0x1)                                        /* (DSU_ENTRY3) Entry present  */
#define DSU_ENTRY3_EPRES_0                    (DSU_ENTRY3_EPRES_0_Val << DSU_ENTRY3_EPRES_Pos)     /* (DSU_ENTRY3) Entry not present Position */
#define DSU_ENTRY3_EPRES_1                    (DSU_ENTRY3_EPRES_1_Val << DSU_ENTRY3_EPRES_Pos)     /* (DSU_ENTRY3) Entry present Position */
#define DSU_ENTRY3_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY3) CoreSight Rom Table Format Position */
#define DSU_ENTRY3_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY3_FMT_Pos)                /* (DSU_ENTRY3) CoreSight Rom Table Format Mask */
#define DSU_ENTRY3_FMT(value)                 (DSU_ENTRY3_FMT_Msk & (_UINT32_(value) << DSU_ENTRY3_FMT_Pos)) /* Assignment of value for FMT in the DSU_ENTRY3 register */
#define   DSU_ENTRY3_FMT_0_Val                _UINT32_(0x0)                                        /* (DSU_ENTRY3) 8-bit format  */
#define   DSU_ENTRY3_FMT_1_Val                _UINT32_(0x1)                                        /* (DSU_ENTRY3) 32-bit format  */
#define DSU_ENTRY3_FMT_0                      (DSU_ENTRY3_FMT_0_Val << DSU_ENTRY3_FMT_Pos)         /* (DSU_ENTRY3) 8-bit format Position */
#define DSU_ENTRY3_FMT_1                      (DSU_ENTRY3_FMT_1_Val << DSU_ENTRY3_FMT_Pos)         /* (DSU_ENTRY3) 32-bit format Position */
#define DSU_ENTRY3_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY3) CoreSight ROM Table Address Offset Position */
#define DSU_ENTRY3_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY3_ADDOFF_Pos)         /* (DSU_ENTRY3) CoreSight ROM Table Address Offset Mask */
#define DSU_ENTRY3_ADDOFF(value)              (DSU_ENTRY3_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY3_ADDOFF_Pos)) /* Assignment of value for ADDOFF in the DSU_ENTRY3 register */
#define DSU_ENTRY3_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY3) Register Mask  */


/* -------- DSU_ENTRY4 : (DSU Offset: 0x1010) ( R/ 32) CoreSight ROM Table Entry 4 Register -------- */
#define DSU_ENTRY4_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_ENTRY4) CoreSight ROM Table Entry 4 Register  Reset Value */

#define DSU_ENTRY4_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY4) CoreSight Entry Present Position */
#define DSU_ENTRY4_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY4_EPRES_Pos)              /* (DSU_ENTRY4) CoreSight Entry Present Mask */
#define DSU_ENTRY4_EPRES(value)               (DSU_ENTRY4_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY4_EPRES_Pos)) /* Assignment of value for EPRES in the DSU_ENTRY4 register */
#define   DSU_ENTRY4_EPRES_0_Val              _UINT32_(0x0)                                        /* (DSU_ENTRY4) Entry not present  */
#define   DSU_ENTRY4_EPRES_1_Val              _UINT32_(0x1)                                        /* (DSU_ENTRY4) Entry present  */
#define DSU_ENTRY4_EPRES_0                    (DSU_ENTRY4_EPRES_0_Val << DSU_ENTRY4_EPRES_Pos)     /* (DSU_ENTRY4) Entry not present Position */
#define DSU_ENTRY4_EPRES_1                    (DSU_ENTRY4_EPRES_1_Val << DSU_ENTRY4_EPRES_Pos)     /* (DSU_ENTRY4) Entry present Position */
#define DSU_ENTRY4_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY4) CoreSight Rom Table Format Position */
#define DSU_ENTRY4_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY4_FMT_Pos)                /* (DSU_ENTRY4) CoreSight Rom Table Format Mask */
#define DSU_ENTRY4_FMT(value)                 (DSU_ENTRY4_FMT_Msk & (_UINT32_(value) << DSU_ENTRY4_FMT_Pos)) /* Assignment of value for FMT in the DSU_ENTRY4 register */
#define   DSU_ENTRY4_FMT_0_Val                _UINT32_(0x0)                                        /* (DSU_ENTRY4) 8-bit format  */
#define   DSU_ENTRY4_FMT_1_Val                _UINT32_(0x1)                                        /* (DSU_ENTRY4) 32-bit format  */
#define DSU_ENTRY4_FMT_0                      (DSU_ENTRY4_FMT_0_Val << DSU_ENTRY4_FMT_Pos)         /* (DSU_ENTRY4) 8-bit format Position */
#define DSU_ENTRY4_FMT_1                      (DSU_ENTRY4_FMT_1_Val << DSU_ENTRY4_FMT_Pos)         /* (DSU_ENTRY4) 32-bit format Position */
#define DSU_ENTRY4_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY4) CoreSight ROM Table Address Offset Position */
#define DSU_ENTRY4_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY4_ADDOFF_Pos)         /* (DSU_ENTRY4) CoreSight ROM Table Address Offset Mask */
#define DSU_ENTRY4_ADDOFF(value)              (DSU_ENTRY4_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY4_ADDOFF_Pos)) /* Assignment of value for ADDOFF in the DSU_ENTRY4 register */
#define DSU_ENTRY4_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY4) Register Mask  */


/* -------- DSU_ENTRY5 : (DSU Offset: 0x1014) ( R/ 32) CoreSight ROM Table Entry 5 Register -------- */
#define DSU_ENTRY5_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_ENTRY5) CoreSight ROM Table Entry 5 Register  Reset Value */

#define DSU_ENTRY5_EPRES_Pos                  _UINT32_(0)                                          /* (DSU_ENTRY5) CoreSight Entry Present Position */
#define DSU_ENTRY5_EPRES_Msk                  (_UINT32_(0x1) << DSU_ENTRY5_EPRES_Pos)              /* (DSU_ENTRY5) CoreSight Entry Present Mask */
#define DSU_ENTRY5_EPRES(value)               (DSU_ENTRY5_EPRES_Msk & (_UINT32_(value) << DSU_ENTRY5_EPRES_Pos)) /* Assignment of value for EPRES in the DSU_ENTRY5 register */
#define   DSU_ENTRY5_EPRES_0_Val              _UINT32_(0x0)                                        /* (DSU_ENTRY5) Entry not present  */
#define   DSU_ENTRY5_EPRES_1_Val              _UINT32_(0x1)                                        /* (DSU_ENTRY5) Entry present  */
#define DSU_ENTRY5_EPRES_0                    (DSU_ENTRY5_EPRES_0_Val << DSU_ENTRY5_EPRES_Pos)     /* (DSU_ENTRY5) Entry not present Position */
#define DSU_ENTRY5_EPRES_1                    (DSU_ENTRY5_EPRES_1_Val << DSU_ENTRY5_EPRES_Pos)     /* (DSU_ENTRY5) Entry present Position */
#define DSU_ENTRY5_FMT_Pos                    _UINT32_(1)                                          /* (DSU_ENTRY5) CoreSight Rom Table Format Position */
#define DSU_ENTRY5_FMT_Msk                    (_UINT32_(0x1) << DSU_ENTRY5_FMT_Pos)                /* (DSU_ENTRY5) CoreSight Rom Table Format Mask */
#define DSU_ENTRY5_FMT(value)                 (DSU_ENTRY5_FMT_Msk & (_UINT32_(value) << DSU_ENTRY5_FMT_Pos)) /* Assignment of value for FMT in the DSU_ENTRY5 register */
#define   DSU_ENTRY5_FMT_0_Val                _UINT32_(0x0)                                        /* (DSU_ENTRY5) 8-bit format  */
#define   DSU_ENTRY5_FMT_1_Val                _UINT32_(0x1)                                        /* (DSU_ENTRY5) 32-bit format  */
#define DSU_ENTRY5_FMT_0                      (DSU_ENTRY5_FMT_0_Val << DSU_ENTRY5_FMT_Pos)         /* (DSU_ENTRY5) 8-bit format Position */
#define DSU_ENTRY5_FMT_1                      (DSU_ENTRY5_FMT_1_Val << DSU_ENTRY5_FMT_Pos)         /* (DSU_ENTRY5) 32-bit format Position */
#define DSU_ENTRY5_ADDOFF_Pos                 _UINT32_(12)                                         /* (DSU_ENTRY5) CoreSight ROM Table Address Offset Position */
#define DSU_ENTRY5_ADDOFF_Msk                 (_UINT32_(0xFFFFF) << DSU_ENTRY5_ADDOFF_Pos)         /* (DSU_ENTRY5) CoreSight ROM Table Address Offset Mask */
#define DSU_ENTRY5_ADDOFF(value)              (DSU_ENTRY5_ADDOFF_Msk & (_UINT32_(value) << DSU_ENTRY5_ADDOFF_Pos)) /* Assignment of value for ADDOFF in the DSU_ENTRY5 register */
#define DSU_ENTRY5_Msk                        _UINT32_(0xFFFFF003)                                 /* (DSU_ENTRY5) Register Mask  */


